---
kind: property
id: P:Autodesk.Revit.DB.Connector.ConnectorType
zh: 连接件、接口
source: html/ca7a5d18-3e10-23c8-75e5-816292b8ca5d.htm
---
# Autodesk.Revit.DB.Connector.ConnectorType Property

**中文**: 连接件、接口

The connector type of the connector.

## Syntax (C#)
```csharp
public ConnectorType ConnectorType { get; }
```